// Задача 1. Задан массив из случайных цифр на 15 элементов. На вход подаётся трёхзначное натуральное число. Напишите программу, которая определяет, есть в массиве последовательность из трёх элементов, совпадающая с введённым числом.

// {0, 5, 6, 2, 7, 7, 8, 1, 1, 9} - 277 -> да
// {4, 4, 3, 6, 7, 0, 8, 5, 1, 2} - 812 -> нет


// Задача 2. На вход подаются два числа случайной длины. Найдите произведение каждого разряда первого числа на каждый разряд второго. Ответ запишите в массив.

// 24, 132 -> {2, 6, 4, 4, 12, 8}


// Задача 3. Найдите все числа от 1 до 1000000, сумма цифр которых в три раза меньше их произведений. Подсчитайте их количество.


// Задача 1*. Дан массив массивов, состоящих из натуральных чисел, размер которого 5. Для каждого элемента-массива требуется найти сумму его элементов и вывести массив с наибольшей суммой. Если таких массивов несколько, вывести массив с наименьшим индексом.

// https://docs.microsoft.com/ru-ru/dotnet/csharp/programming-guide/arrays/jagged-arrays
