// Задача 1. Дан двумерный массив. Заменить в нём элементы первой строки элементами главной диагонали. А элементы последней строки, элементами побочной диагонали.

//  1   2   3   4                1   6  11 15
//  5   6   7   8     =>       5   6   7  8 
// 9  10 11 12                9  10 11 12
// 12 13 14 15              12 10  7  4

// Задача 2. Дан двумерный массив, заполненный случайными числами от -9 до 9. Подсчитать частоту вхождения каждого числа в массив, используя словарь.
// Справка:
// https://docs.microsoft.com/ru-ru/dotnet/api/system.collections.generic.dictionary-2?view=net-6.0

// Задача 3. Найти минимальный по модулю элемент. Все столбцы и строки, содержащие элементы, равные по модулю минимальному.

// Задача 4. Заполните двумерный массив 3х3 числами от 1 до 9 змейкой.

// 1  6  7
// 2  5  8
// 3  4  9
