
// Задача 1. Написать перевод десятичного числа в двоичное, используя рекурсию.

// Задача 2. На вход подаётся поговорка “без труда не выловишь и рыбку из пруда”. Используя рекурсию, подсчитайте, сколько в поговорке гласных букв.

// Задача 3. Дано число N. Используя только операцию деления и рекурсию, определите, что оно является степенью числа 3.



// Задача 1*. Создайте программу, показывающую текущее время. Для вывода чисел используйте двумерные массивы.



// https://docs.microsoft.com/ru-ru/dotnet/api/system.datetime?view=net-6.0

