// Задача 1. На вход подаётся натуральное десятичное число. Проверьте, является ли оно палиндромом в двоичной записи.

// Задача 2. Напишите метод, который заполняет массив случайным количеством (от 1 до 100) нулей и единиц. Размер массива должен совпадать с квадратом количества единиц в нём.

// Задача 3. Массив на 100 элементов задаётся случайными числами от 1 до 99. Определите самый часто встречающийся элемент в массиве. Если таких элементов несколько, вывести их все.


// Создание игры: 

// Задача 1*. С помощью команд очистки консоли и печати реализовать игру-бродилку в консоли.
// https://docs.microsoft.com/ru-ru/dotnet/api/system.console.clear?view=net-6.0
// https://docs.microsoft.com/ru-ru/dotnet/api/system.console.setcursorposition?view=net-6.0
// https://docs.microsoft.com/ru-ru/dotnet/api/system.console.readkey?view=net-6.0
// https://docs.microsoft.com/ru-ru/dotnet/api/system.consolekey?view=net-6.0

// Задача 2*. Создать игру лабиринт.
