// Задача 1. Даны две матрицы, количество строк и столбцов которых может быть 3 или 4, заполнены числами от -9 до 9. Выполните умножение матриц.
// Дополнительный материал по задаче:
// https://portal.tpu.ru/SHARED/k/KONVAL/Sites/Russian_sites/1/04.htm

// Задача 2. Двумерный массив размером 3х4 заполнен числами от 100 до 9999. Найдите в этом массиве и сохраните в одномерный массив все числа, сумма цифр которых больше их произведения. Выведите оба массива.

// Задача 3. Двумерный массив размером 5х5 заполнен случайными нулями и единицами. Игрок может ходить только по полям, заполненным единицами. Проверьте, существует ли путь из точки [0, 0] в точку [4, 4] (эти поля требуется принудительно задать равными единице).
