//Задача 1. Рассчитать значение y при заданном x по формуле
// y =sin^2*x при х>0,
// в противном случае y = 1-2sin*x^2

//Задача 2. Дано трёхзначное число N. Определить кратна ли трём сумма всех его цифр.

// Задача 3. Дано трёхзначное число N. Определить, есть ли среди его цифр 4 или 7.

// Задача 4. Дан массив длиной 10 элементов. Заполнить его последовательно числами от 1 до 10.

// Задачи повышенной сложности:
// Задача 1. На ввод подаётся номер четверти. Создаются 3 случайные точки в этой четверти. Определите самый оптимальный маршрут для торгового менеджера, который выезжает из центра координат.

// Задача 2. Даны 4 точки a, b, c, d. Пересекаются ли вектора AB и CD?


// Задача 3. Найти в какой четверти лежит точка пересечения из задачи 2 (если вектора пересекаются).

// Задача 4. Дан массив средних температур (массив заполняется случайно) за последние 10 лет. На ввод подают номер месяца и год начали и конца.
// Определить самые высокие и низкие температуры для лета, осени, зимы и весны в заданном промежутке. Если таких температур нет, сообщить, что определить не удалось.

// Задача 5. На вход подаётся число n > 4, указывающее длину пароля. Создайте метод, генерирующий пароль заданной длины. В пароле обязательно использовать цифру, букву и специальный знак.

// Задача 6. Из центра координат к точке А(x, y) проведён отрезок АО. Напишите программу, определяющую наименьший угол наклона отрезка AO к оси X.

// Задача 7. Массив из ста элементов заполняется случайными числами от 1 до 100. Удалить из массива все элементы, содержащие цифру 3. Вывести в консоль новый массив и количество удалённых элементов.



// Задача 8. Напишите программу, который выводит на консоль таблицу умножения от 1 до n, где n задаётся случайно от 2 до 100.

// Задача 9. Дана игра со следующими правилами. Первый игрок называет любое натуральное число от 2 до 9, второй умножает его на любое натуральное число от 2 до 9, первый умножает результат на любое натуральное число от 2 до 9 и т. д. Выигрывает тот, у кого впервые получится число больше 1000. Запрограммировать консольный вариант игры.
